ci4/app/Controllers/LeaveController.php

    public function byDriver($driverId = null)
    {
        $driverId = (int)$driverId;
        if ($driverId <= 0) {
            return $this->failValidationErrors('Invalid driver_id.');
        }

        $db = \Config\Database::connect();
        $rows = $db->table('leave_applications')
            ->where('driver_id', $driverId)
            ->orderBy('created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `leave_applications`
WHERE `driver_id` = 1
ORDER BY `created_at` DESC