ci4/app/Controllers/VolunteerController.php

SELECT `schedule_date`, `expected_start`, `expected_end`
FROM `schedules`
WHERE `driver_id` = 1
AND `schedule_date` >= '2026-06-02'
---
    public function available()
    {
        $driverId = (int)$this->request->getGet('driver_id');
        if ($driverId <= 0) {
            return $this->failValidationErrors('driver_id is required.');
        }

        $db = \Config\Database::connect();

        // List unassigned future trips.
        $today = date('Y-m-d');
        $rows = $db->table('schedules s')
            ->select('s.*, r.route_name, r.origin, r.destination, b.plate_number,
                      EXISTS(SELECT 1 FROM volunteer_requests vr
                             WHERE vr.schedule_id = s.schedule_id
                               AND vr.driver_id   = ' . (int)$driverId . '
                               AND vr.status      = "Pending") AS already_requested')
            ->join('routes r', 'r.route_id = s.route_id')
            ->join('buses b',  'b.bus_id   = s.bus_id')
            ->where('s.driver_id IS NULL', null, false)
            ->where('s.schedule_date >=', $today)
            ->orderBy('s.schedule_date', 'ASC')
            ->orderBy('s.expected_start', 'ASC')
            ->get()->getResultArray();

        // Filter out trips that overlap with this driver's existing
        // assignments (so they can't accidentally double-book).
        $mine = $db->table('schedules')
            ->select('schedule_date, expected_start, expected_end')
            ->where('driver_id', $driverId)
            ->where('schedule_date >=', $today)
            ->get()->getResultArray();

SELECT *
FROM `schedules`
WHERE `schedule_id` = 20
SELECT COUNT(*) AS `numrows`
FROM `volunteer_requests`
WHERE `schedule_id` = 20
AND `driver_id` = 1
AND `status` = 'Pending'
---
    public function create()
    {
        $in = $this->request->getJSON(true) ?? $this->request->getPost();

        $scheduleId = (int)($in['schedule_id'] ?? 0);
        $driverId   = (int)($in['driver_id']   ?? 0);
        $note       = trim($in['note'] ?? '');

        if ($scheduleId <= 0 || $driverId <= 0) {
            return $this->failValidationErrors('schedule_id and driver_id are required.');
        }

        $db = \Config\Database::connect();

        // Trip must still be unassigned.
        $sched = $db->table('schedules')
            ->where('schedule_id', $scheduleId)
            ->get()->getRowArray();
        if (!$sched) {
            return $this->failNotFound('Schedule not found.');
        }
        if ($sched['driver_id'] !== null) {
            return $this->failValidationErrors('That trip is no longer available.');
        }

        // No duplicate pending volunteer for same driver+trip.
        $existing = $db->table('volunteer_requests')
            ->where('schedule_id', $scheduleId)
            ->where('driver_id',   $driverId)
            ->where('status', 'Pending')
            ->countAllResults();

INSERT INTO `volunteer_requests` (`schedule_id`, `driver_id`, `note`, `status`) VALUES (20, 1, 'dari 1pm hingga 2pm', 'Pending')
---
                'You already have a pending volunteer request for this trip.');
        }

        $db->table('volunteer_requests')->insert([
            'schedule_id' => $scheduleId,
            'driver_id'   => $driverId,
            'note'        => $note ?: null,
            'status'      => 'Pending',
        ]);