ci4/app/Controllers/Web/AuthWebController.php

SELECT *
FROM `supervisors`
WHERE `employee_id` = 'SUP001'
---
    public function doLogin()
    {
        // The form sends "employee_id" now (was "email" before).
        $employeeId = trim($this->request->getPost('employee_id') ?? '');
        $password   = (string)($this->request->getPost('password') ?? '');
        $role       = $this->request->getPost('role') ?? 'supervisor';

        if ($employeeId === '' || $password === '') {
            return redirect()->back()->withInput()
                ->with('error', 'Employee ID and password are required.');
        }

        $tables = [
            'supervisor' => ['table' => 'supervisors', 'id' => 'supervisor_id'],
            'admin'      => ['table' => 'admins',      'id' => 'admin_id'],
        ];
        if (!isset($tables[$role])) {
            return redirect()->back()->with('error', 'Invalid role.');
        }

        $db   = \Config\Database::connect();
        $user = $db->table($tables[$role]['table'])
                   ->where('employee_id', $employeeId)
                   ->get()->getRowArray();