ci4/app/Controllers/Web/SupervisorController.php

    public function dashboard()
    {
        $db = \Config\Database::connect();
        $today = date('Y-m-d');

        $stats = [
            'today_total'    => $db->table('schedules')->where('schedule_date',$today)->countAllResults(),
            'in_progress'    => $db->table('schedules')->where('schedule_date',$today)
                                   ->where('job_status','In-Progress')->countAllResults(),
            'completed'      => $db->table('schedules')->where('schedule_date',$today)
                                   ->where('job_status','Completed')->countAllResults(),
            'pending_ot'     => $db->table('overtime_requests')->where('status','Pending')->countAllResults(),
            'pending_leave'  => $db->table('leave_applications')->where('status','Pending')->countAllResults(),
        ];

        $todaySchedules = $db->table('schedules s')
            ->select('s.*, d.full_name AS driver_name, r.route_name, b.plate_number')
            ->join('drivers d', 'd.driver_id = s.driver_id')
            ->join('routes r',  'r.route_id  = s.route_id')
            ->join('buses b',   'b.bus_id    = s.bus_id')
            ->where('s.schedule_date', $today)
            ->orderBy('s.expected_start')
            ->get()->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `schedule_date` = '2026-06-11'
AND `job_status` = 'In-Progress'
SELECT COUNT(*) AS `numrows`
FROM `schedules`
WHERE `schedule_date` = '2026-06-11'
AND `job_status` = 'Completed'
SELECT COUNT(*) AS `numrows`
FROM `overtime_requests`
WHERE `status` = 'Pending'
SELECT COUNT(*) AS `numrows`
FROM `leave_applications`
WHERE `status` = 'Pending'
SELECT `s`.*, `d`.`full_name` AS `driver_name`, `r`.`route_name`, `b`.`plate_number`
FROM `schedules` `s`
JOIN `drivers` `d` ON `d`.`driver_id` = `s`.`driver_id`
JOIN `routes` `r` ON `r`.`route_id`  = `s`.`route_id`
JOIN `buses` `b` ON `b`.`bus_id`    = `s`.`bus_id`
WHERE `s`.`schedule_date` = '2026-06-11'
ORDER BY `s`.`expected_start`

    public function schedules()
    {
        $db = \Config\Database::connect();

        // No date param = show ALL schedules (most recent first).
        // ?date=YYYY-MM-DD = filter to that specific day.
        $date = $this->request->getGet('date');   // null if not set

        $query = $db->table('schedules s')
            ->select('s.*, d.full_name AS driver_name, r.route_name,
                      r.origin, r.destination, b.plate_number')
            ->join('drivers d', 'd.driver_id = s.driver_id', 'left')   // LEFT: unassigned trips have driver_id = NULL
            ->join('routes r',  'r.route_id  = s.route_id')
            ->join('buses b',   'b.bus_id    = s.bus_id');

        if (!empty($date)) {
            $query->where('s.schedule_date', $date);
        }

        $rows = $query
            ->orderBy('s.schedule_date', 'DESC')
            ->orderBy('s.expected_start', 'ASC')
            ->get()->getResultArray();
---
SELECT `s`.*, `d`.`full_name` AS `driver_name`, `r`.`route_name`, `r`.`origin`, `r`.`destination`, `b`.`plate_number`
FROM `schedules` `s`
LEFT JOIN `drivers` `d` ON `d`.`driver_id` = `s`.`driver_id`
JOIN `routes` `r` ON `r`.`route_id`  = `s`.`route_id`
JOIN `buses` `b` ON `b`.`bus_id`    = `s`.`bus_id`
ORDER BY `s`.`schedule_date` DESC, `s`.`expected_start` ASC

    public function scheduleEdit($id)
    {
        $db = \Config\Database::connect();
        $sched = $db->table('schedules')->where('schedule_id',$id)->get()->getRowArray();
        if (!$sched) return redirect()->to('/supervisor/schedules');

        return $this->render('Edit Schedule', 'supervisor/schedule_form', [
            'mode'    => 'edit',
            'sched'   => $sched,
            'drivers' => $db->table('drivers')->where('status','active')->get()->getResultArray(),
            'routes'  => $db->table('routes')->get()->getResultArray(),
            'buses'   => $db->table('buses')->get()->getResultArray(),
---
SELECT *
FROM `schedules`
WHERE `schedule_id` = '19'
SELECT *
FROM `drivers`
WHERE `status` = 'active'
SELECT *
FROM `routes`
SELECT *
FROM `buses`

    public function overtime()
    {
        $db = \Config\Database::connect();
        $rows = $db->table('overtime_requests ot')
            ->select('ot.*, s.schedule_date, s.expected_end, s.actual_end,
                      d.full_name AS driver_name, r.route_name')
            ->join('schedules s', 's.schedule_id = ot.schedule_id')
            ->join('drivers d',   'd.driver_id   = s.driver_id')
            ->join('routes r',    'r.route_id    = s.route_id')
            ->orderBy('ot.created_at','DESC')
            ->get()->getResultArray();
---
SELECT `ot`.*, `s`.`schedule_date`, `s`.`expected_end`, `s`.`actual_end`, `d`.`full_name` AS `driver_name`, `r`.`route_name`
FROM `overtime_requests` `ot`
JOIN `schedules` `s` ON `s`.`schedule_id` = `ot`.`schedule_id`
JOIN `drivers` `d` ON `d`.`driver_id`   = `s`.`driver_id`
JOIN `routes` `r` ON `r`.`route_id`    = `s`.`route_id`
ORDER BY `ot`.`created_at` DESC

    public function leave()
    {
        $db = \Config\Database::connect();
        $rows = $db->table('leave_applications l')
            ->select('l.*, d.full_name AS driver_name')
            ->join('drivers d', 'd.driver_id = l.driver_id')
            ->orderBy('l.created_at','DESC')
            ->get()->getResultArray();
---
SELECT `l`.*, `d`.`full_name` AS `driver_name`
FROM `leave_applications` `l`
JOIN `drivers` `d` ON `d`.`driver_id` = `l`.`driver_id`
ORDER BY `l`.`created_at` DESC

    public function fleet()
    {
        $db = \Config\Database::connect();
        $today = date('Y-m-d');

        $fleet = $db->table('buses b')
            ->select('
                b.bus_id, b.plate_number, b.mac_address, b.status AS bus_status,
                s.schedule_id, s.job_status, s.expected_start, s.expected_end,
                s.actual_start, s.actual_end, s.is_synced,
                d.full_name AS driver_name,
                r.route_name, r.origin, r.destination
            ')
            ->join('schedules s',
                "s.bus_id = b.bus_id AND s.schedule_date = '{$today}' AND s.job_status IN ('Pending','In-Progress')",
                'left')
            ->join('drivers d', 'd.driver_id = s.driver_id', 'left')
            ->join('routes r',  'r.route_id  = s.route_id',  'left')
            ->orderBy('b.plate_number')
            ->get()->getResultArray();
---
SELECT `b`.`bus_id`, `b`.`plate_number`, `b`.`mac_address`, `b`.`status` AS `bus_status`, `s`.`schedule_id`, `s`.`job_status`, `s`.`expected_start`, `s`.`expected_end`, `s`.`actual_start`, `s`.`actual_end`, `s`.`is_synced`, `d`.`full_name` AS `driver_name`, `r`.`route_name`, `r`.`origin`, `r`.`destination`
FROM `buses` `b`
LEFT JOIN `schedules` `s` ON `s`.`bus_id` = `b`.`bus_id` AND `s`.`schedule_date` = '2026-06-11' AND `s`.`job_status` IN ('Pending','In-Progress')
LEFT JOIN `drivers` `d` ON `d`.`driver_id` = `s`.`driver_id`
LEFT JOIN `routes` `r` ON `r`.`route_id`  = `s`.`route_id`
ORDER BY `b`.`plate_number`

    public function cancellations()
    {
        $db = \Config\Database::connect();
        $rows = $db->table('cancel_requests cr')
            ->select('cr.*, d.full_name AS driver_name,
                      s.schedule_date, s.expected_start, s.expected_end,
                      r.route_name, b.plate_number')
            ->join('drivers d',   'd.driver_id   = cr.driver_id')
            ->join('schedules s', 's.schedule_id = cr.schedule_id')
            ->join('routes r',    'r.route_id    = s.route_id')
            ->join('buses b',     'b.bus_id      = s.bus_id')
            ->orderBy('cr.status', 'ASC')  // Pending first
            ->orderBy('cr.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `cr`.*, `d`.`full_name` AS `driver_name`, `s`.`schedule_date`, `s`.`expected_start`, `s`.`expected_end`, `r`.`route_name`, `b`.`plate_number`
FROM `cancel_requests` `cr`
JOIN `drivers` `d` ON `d`.`driver_id`   = `cr`.`driver_id`
JOIN `schedules` `s` ON `s`.`schedule_id` = `cr`.`schedule_id`
JOIN `routes` `r` ON `r`.`route_id`    = `s`.`route_id`
JOIN `buses` `b` ON `b`.`bus_id`      = `s`.`bus_id`
ORDER BY `cr`.`status` ASC, `cr`.`created_at` DESC

    public function volunteers()
    {
        $db = \Config\Database::connect();
        $rows = $db->table('volunteer_requests vr')
            ->select('vr.*, d.full_name AS driver_name,
                      s.schedule_date, s.expected_start, s.expected_end, s.driver_id AS current_driver_id,
                      r.route_name, b.plate_number')
            ->join('drivers d',   'd.driver_id   = vr.driver_id')
            ->join('schedules s', 's.schedule_id = vr.schedule_id')
            ->join('routes r',    'r.route_id    = s.route_id')
            ->join('buses b',     'b.bus_id      = s.bus_id')
            ->orderBy('vr.status', 'ASC')
            ->orderBy('vr.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `vr`.*, `d`.`full_name` AS `driver_name`, `s`.`schedule_date`, `s`.`expected_start`, `s`.`expected_end`, `s`.`driver_id` AS `current_driver_id`, `r`.`route_name`, `b`.`plate_number`
FROM `volunteer_requests` `vr`
JOIN `drivers` `d` ON `d`.`driver_id`   = `vr`.`driver_id`
JOIN `schedules` `s` ON `s`.`schedule_id` = `vr`.`schedule_id`
JOIN `routes` `r` ON `r`.`route_id`    = `s`.`route_id`
JOIN `buses` `b` ON `b`.`bus_id`      = `s`.`bus_id`
ORDER BY `vr`.`status` ASC, `vr`.`created_at` DESC

    public function volunteerReview($id)
    {
        $decision = $this->request->getPost('decision');
        if (!in_array($decision, ['Approved','Rejected'], true)) {
            return redirect()->to('supervisor/volunteers');
        }

        $db = \Config\Database::connect();
        $vol = $db->table('volunteer_requests')
            ->where('volunteer_id', $id)
            ->get()->getRowArray();
        if (!$vol) return redirect()->to('supervisor/volunteers');

        $db->table('volunteer_requests')->where('volunteer_id', $id)->update([
            'status'        => $decision,
            'supervisor_id' => session('user_id'),
            'reviewed_at'   => date('Y-m-d H:i:s'),
        ]);
---
SELECT *
FROM `volunteer_requests`
WHERE `volunteer_id` = '3'
UPDATE `volunteer_requests` SET `status` = 'Rejected', `supervisor_id` = '1', `reviewed_at` = '2026-06-11 13:21:00'
WHERE `volunteer_id` = '3'

    public function unassigned()
    {
        $db = \Config\Database::connect();
        $today = date('Y-m-d');
        $rows = $db->table('schedules s')
            ->select('s.*, r.route_name, r.origin, r.destination, b.plate_number')
            ->join('routes r', 'r.route_id = s.route_id')
            ->join('buses b',  'b.bus_id   = s.bus_id')
            ->where('s.driver_id IS NULL', null, false)
            ->where('s.schedule_date >=', $today)
            ->orderBy('s.schedule_date', 'ASC')
            ->orderBy('s.expected_start', 'ASC')
            ->get()->getResultArray();

        $drivers = $db->table('drivers')
            ->where('status', 'active')
            ->orderBy('full_name')
            ->get()->getResultArray();
---
SELECT `s`.*, `r`.`route_name`, `r`.`origin`, `r`.`destination`, `b`.`plate_number`
FROM `schedules` `s`
JOIN `routes` `r` ON `r`.`route_id` = `s`.`route_id`
JOIN `buses` `b` ON `b`.`bus_id`   = `s`.`bus_id`
WHERE s.driver_id IS NULL
AND `s`.`schedule_date` >= '2026-06-02'
ORDER BY `s`.`schedule_date` ASC, `s`.`expected_start` ASC
SELECT *
FROM `drivers`
WHERE `status` = 'active'
ORDER BY `full_name`